IDEA Open Model
WeldingType Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Welding Type
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum WeldingType
Public Enumeration WeldingType
Members
Member name | Value | Description
Manual | 0 |  Manual welding
ManualSmallRodDiam | 1 |  Manual welding using rod solid cross-section with diameter less than 1.4mm
AutomaticAndMachine | 2 |  Automatic and machine welding
Automatic | 3 |  Automatic welding
See Also
Reference
IdeaRS.OpenModel Namespace